my_app/app/models/cart.rb

UPDATE "cart_items" SET "updated_at" = '2025-07-29 15:26:19.447416', "quantity" = 2 WHERE "cart_items"."id" = 90
---
    def add_to_cart(product_id)
        cart_item = cart_items.find_or_initialize_by(product_id: product_id)
        cart_item.quantity += 1 unless cart_item.new_record?

        product = cart_item.product
        if product.product_code == 'GR1'
            cart_item.quantity = (cart_item.quantity / 2.0).ceil * 2
        end

        cart_item.save

DELETE FROM "cart_items" WHERE "cart_items"."id" = 118
UPDATE "cart_items" SET "updated_at" = '2025-07-29 15:36:06.824177', "quantity" = 1 WHERE "cart_items"."id" = 114
---
    def remove_from_cart(product_id)
        cart_item = cart_items.find_by(product_id: product_id)

        cart_item.quantity -= 1

        if cart_item.quantity == 0
            cart_item.destroy
        else
            cart_item.save