my_app/app/controllers/cart_controller.rb

    def show
        @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 59 LIMIT 1

    def create
        @cart = Cart.create()
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2025-07-29 15:14:16.262783', '2025-07-29 15:14:16.262783') RETURNING "id"

    def add_item
        @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 87 LIMIT 1

    def remove_item
        @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 114 LIMIT 1