my_app/app/controllers/cart_controller.rb

    def add_item
        item = Item.find(params[:item_id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1

    def remove_item
        item = Item.find(params[:item_id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 114